Autodesk.Revit.DB.PointOnEdge.LocationOnCurve
The point location on curve.

Autodesk.Revit.DB.PointOnEdge.SetEdgeReference(Autodesk.Revit.DB.Reference)
Change the edge or curve reference.
Remarks: The referenced element may be any model element, including
FamilyInstance, FormElement, or CurveElement. The reference
must be of type ElementReferenceType.REFERENCE_TYPE_LINEAR.

Autodesk.Revit.DB.PointOnEdge.GetEdgeReference
Get a copy of the edge or curve reference.

Autodesk.Revit.DB.PointOnEdge
Define a ReferencePoint relative to a referenceable edge or
curve on another element.
Remarks: The ReferencePoint's X basis vector is constrained to the
tangent vector to the curve. The Y and Z vectors are free to rotate
around the curve.